package by.homework.lesson9;

public class MainAnimal {
    public static void main(String[] args) {

        System.out.println("\n---------------------------------------------------------------------------------------------------------" +
                "\n1.1 Создать по объекту соответствующих классов продемонстрировать поведение собак и птиц. (вызвать соответствующие методы в классах собака и птица)" +
                "\n---------------------------------------------------------------------------------------------------------");
        Animal animal = new Animal(0, "рыжий", 1, "всё");
        Dog chihuahua = new Dog(1, "черно-белый", 10, "мясо", "Чип", "чихуахуа", 5);
        Bird grach = new Bird(4, "Тёмный", 3, "насекомые", "грач", 500);
        chihuahua.makeSounds();
        chihuahua.bite();
        chihuahua.animalPlay();
        chihuahua.jump();
        chihuahua.run();
        grach.makeSounds();
        grach.peck();
        grach.hatch();

        System.out.println("\n---------------------------------------------------------------------------------------------------------" +
                "\n1.2 Реализовать метод, который будет выводить информацию о собаке, птице, животном (toString)" +
                "\n---------------------------------------------------------------------------------------------------------");
        System.out.println(chihuahua.toString());
        System.out.println(grach.toString());

        Zoo zoo = new Zoo();

        System.out.println("\n---------------------------------------------------------------------------------------------------------" +
                "\n1.6 Используя метод по добавлению животного в зоопарк (п.1.4) добавить по три собаки и по три птицы. " +
                "\n(Выполнять это в методе Main, создав соответствующие объекты зоопарка, птиц, собак и т.д.) " +
                "\n---------------------------------------------------------------------------------------------------------");
        Animal ovcharka = new Dog(2, "рыжий", 15, "мясо", "Рекс", "овчарка", 20);
        Animal doberman = new Dog(3, "черный", 14, "мясо", "Джек", "доберман", 18);
        Animal sinica = new Bird(5, "серо-желтый", 2, "насекомые", "синица", 200);
        Animal bysel = new Bird(6, "бело-черный", 5, "мясо", "буслiк", 1000);

        zoo.addAnimal(chihuahua);
        zoo.addAnimal(ovcharka);
        zoo.addAnimal(doberman);
        zoo.addAnimal(grach);
        zoo.addAnimal(sinica);
        zoo.addAnimal(bysel);

        System.out.println("\n---------------------------------------------------------------------------------------------------------" +
                "\n1.7 Получить всех животных из зоопарка. Пройтись по всем животным в зоопарке и вызвать методы (издание звуков, животное играет). " +
                "\nУ вас должны вывестись соответствующие реализации для 3 собак и для трёх птиц(Выполнять это в методе Main)" +
                "\n---------------------------------------------------------------------------------------------------------");
        for (Animal z : zoo.getAnimals()) {
            z.makeSounds();
            z.animalPlay();
        }

        System.out.println("\n---------------------------------------------------------------------------------------------------------" +
                "\n1.8 * Создайте пару львов и выведите их поведение в консоль. Добавить трех львов в зоопарк. " +
                "\nУ вас должно быть девять животных в зоопарке. Ещё раз пройдитесь по всем животным и вызовите методы (издание звуков, животное играет).." +
                "\nУ вас должны вывестись соответствующие реализации для 3 собак, для трёх птиц и 3 львов (Выполнять это в методе Main)" +
                "\n---------------------------------------------------------------------------------------------------------");
        Lion lion1 = new Lion(7, "белый", 20, "добыча", "Джордж", "вожак", 10);
        Lion lion2 = new Lion(8, "рыжий", 20, "добыча", "Саманта", "охотник", 6);
        Lion lion3 = new Lion(9, "бело-рыжий", 20, "добыча", "Боб", "детеныш", 1);
        zoo.addAnimal(lion1);
        zoo.addAnimal(lion2);
        zoo.addAnimal(lion3);
        for (Animal z : zoo.getAnimals()) {
            z.makeSounds();
            z.animalPlay();
        }

        System.out.println("\n---------------------------------------------------------------------------------------------------------" +
                "\nРеализовать метод по удалению животного из зоопарка по номеру (id)" +
                "\n---------------------------------------------------------------------------------------------------------");
        zoo.removeAnimal(3);
        zoo.getAnimals();

        System.out.println("\n---------------------------------------------------------------------------------------------------------" +
                "\nРеализуйте метод, который будет выводить всю информацию о каждом животном в зоопарке." +
                "\n---------------------------------------------------------------------------------------------------------");
        zoo.infoAnimals();

        System.out.println("\n---------------------------------------------------------------------------------------------------------" +
                "\n1. Переопределить метод equals и hashcode в классах Птица и Собака из предыдущего задания." +
                "\n---------------------------------------------------------------------------------------------------------");
        Animal doberman1 = new Dog(3, "черный", 14, "мясо", "Джек", "доберман", 20);
        System.out.println("doberman1 (\"Джек\", \"доберман\", 20) и doberman (\"Джек\", \"доберман\", 18) равны? - " + doberman1.equals(doberman));

        System.out.println("sinica (\"синица\", 200) = bysel (\"буслiк\", 1000) ? - " + sinica.equals(bysel));

    }
}
